# Aggregations

### Step 1. Import the necessary libraries

In [2]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset occupation.csv from the folder or [here](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [3]:
df = pd.read_csv('C:/Users/kanika2/CaseStudy/Exercise Data Files/Exercise Data Files/Pandas Exercise Aggregation Files/occupation.csv',delimiter='|')

### Step 3. Assign it to a variable called users.

In [4]:
users = df

In [5]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [6]:
users.groupby('occupation')['age'].mean().head()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
Name: age, dtype: float64

# Step 5. Discover the Male ratio per occupation and sort it from the most to the least.

Use numpy.where() to encode gender column.

In [37]:
GroupByDF = users[users['gender'] == 'M'].groupby('occupation').agg({'gender': 'count'}).reset_index()

In [41]:
GroupByDF.sort_values(by = 'gender', ascending = False).head()

    occupation  gender
18     student     136
13       other      69
3     educator      69
4     engineer      65
14  programmer      60

### Step 6. For each occupation, calculate the minimum and maximum ages

In [13]:
users.groupby('occupation').agg({'age': ['min','max']}).head()

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70

### Step 7. For each combination of occupation and gender, calculate the mean age

In [24]:
users.groupby(['occupation','gender'])['age'].mean().head(10)

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
Name: age, dtype: float64

### Step 8.  For each occupation present the percentage of women and men

In [35]:
(users['gender'].value_counts(normalize=True) * 100).round(2)

M    71.05
F    28.95
Name: gender, dtype: float64

In [36]:
((users.groupby('gender').size()/users['gender'].count())*100).round(2)

gender
F    28.95
M    71.05
dtype: float64